Series 
Is a one dimensional aar capable of holding multiple data type, The axis labels are correctively called the index.

In [ ]:
Creating series

In [10]:
import numpy as np
import pandas as pd 

#!pip install pandas

In [27]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {1:10, 2:20, 3:30}

In [18]:
#creating series
pd.Series(my_list) 

##will represnt the data vertically
labels , dp

0    10
1    20
2    30
dtype: int64

In [20]:
#custom lables 
pd.Series(my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [25]:
#creating series from arrays
pd.Series(arr, index = labels)

a    10
b    20
c    30
dtype: int64

In [29]:
# using dictionaries will create auto index values 
pd.Series(d)

1    10
2    20
3    30
dtype: int64

Dataframe 

When you combine multiple series together 

Creating a coloumns

In [30]:
data = {
    'Name':   ['John', 'Anna', 'Peter', 'Linda'],
    'Age':    [28, 34, 29, 42],
    'City':   ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
pd.DataFrame(data)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [38]:
#creating df using list 

data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City', 'Salary']

df2 = pd.DataFrame(data_list, columns= columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selection and indexing of columns

In [45]:
df2['Name']
df2['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [47]:
df2[['Name', 'City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

Creating a new column

In [51]:
df2["Designation"] = ['doctor', 'engineer', 'engineer', 'doctor']

In [52]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      doctor
1   Anna   34     Paris   70000    engineer
2  Peter   29    Berlin   62000    engineer
3  Linda   42    London   85000      doctor

Remove a columns

In [55]:
df2.drop('Designation', axis = 1, inplace = True)

In [56]:
##axis = 0, will be used to drop the rows

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selecting a row

In [57]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [63]:
##WILL RETURN THE VALUES 
df2.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [65]:
#WILL RETURN THE INDEX VALUE 
df2.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

SELECTING SUBSETS OF ROWS AND COLUMNS

In [90]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [74]:
df2.loc[[0,1]][["City", "Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [77]:
df2.loc[[0,1]][['Name','Age']]

   Name  Age
0  John   28
1  Anna   34

In [81]:
df2.loc[[0,1]][['Name','Age']]

   Name  Age
0  John   28
1  Anna   34

In [82]:
df2.loc[[2,3]]

    Name  Age    City  Salary
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

Conditional Selection

In [83]:
df2
# will make it column wise

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [87]:
## people who's age is more then 30

df2.loc[df2['Age'] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [89]:
df2.loc[(df2['Age'] > 30) & (df2['City'] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000

MISSING DATA

In [91]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df=pd.DataFrame(data)

In [92]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [95]:
##finding null values

df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [96]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [97]:
##checking coloumns
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

Removing Null values (always based on rows)

In [102]:
#removing the whole row
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [103]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [104]:
##threshold will remove all the null values

In [113]:
df.dropna(thresh = 3)
#will drop the data row wise

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

Filling the missing data

In [106]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [107]:
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [108]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [109]:
##filling missing values for different for each columns

In [112]:
values= {'A': 0, 'B': 100, 'C': 200, 'D': 300}
df.fillna(value = values, inplace = 'true')

##will fill the values column wise

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  300.0
2  0.0  3    3.0  300.0
3  4.0  4  200.0  300.0
4  5.0  5  200.0    5.0

In [111]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [114]:
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

Mergining joinin and concatenation

In [115]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [116]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [117]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [120]:
#merging two db
pd.merge(employees, salaries, on = 'employee_id', how ='inner')

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [121]:
pd.merge(employees, salaries, on = 'employee_id', how = 'outer')

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [122]:
pd.merge(employees, salaries, on = 'employee_id', how = 'left')

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

pd.merge(employees, salaries, on = 'employee_id', how = 'right')

Concatentation

In [123]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [124]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [125]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [126]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [127]:
pd.concat([df2,df1])

#on column wise

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [129]:
pd.concat([df2,df1], axis = 1)
#on row wise

    A   B   C   A   B   C
0  A3  B3  C3  A0  B0  C0
1  A4  B4  C4  A1  B1  C1
2  A5  B5  C5  A2  B2  C2

Joining

In [130]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [131]:
df1

      name
1    Alice
2      Bob
3  Charlie

df2

In [135]:
df1.join(df2, how ='outer')

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

In [136]:
df1.join(df2)

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0

In [ ]:
GROUP BY (can be performed only on quantitative data)

In [137]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)

In [138]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [143]:
#group by category and calculate the sum
cat = df.groupby('Category')['Sales'].sum()
cat

Category
A    570
B    930
Name: Sales, dtype: int64

In [146]:
cat_stores = df.groupby('Store')['Sales'].sum()
cat_stores

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [149]:
catt = df.groupby(['Category', 'Store'])['Sales'].sum()
catt

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

AGGREGATION

In [150]:
df['Sales'].mean()

np.float64(187.5)

In [151]:
"""mean median min max count std """
df['Sales'].agg(['sum', 'mean', 'min', 'max', 'count', 'std', 'median'])

sum       1500.000000
mean       187.500000
min        100.000000
max        300.000000
count        8.000000
std         66.062741
median     190.000000
Name: Sales, dtype: float64

Pivot

In [12]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

In [14]:
df = pd.DataFrame(data)
df

         Date Product Region  Sales  Units    Rep
0  2023-01-01       A   East    494     18   John
1  2023-01-02       B   West    592     43   Mary
2  2023-01-03       C  North    493     19    Bob
3  2023-01-04       D  South    194     70  Alice
4  2023-01-05       A   East    821     46   John
5  2023-01-06       B   West    581     22   Mary
6  2023-01-07       C  North    991     95    Bob
7  2023-01-08       D  South    584     70  Alice
8  2023-01-09       A   East    733     44   John
9  2023-01-10       B   West    887     32   Mary
10 2023-01-11       C  North    898     25    Bob
11 2023-01-12       D  South    625     12  Alice
12 2023-01-13       A   East    206     65   John
13 2023-01-14       B   West    130     37   Mary
14 2023-01-15       C  North    127     47    Bob
15 2023-01-16       D  South    149     66  Alice
16 2023-01-17       A   East    730     29   John
17 2023-01-18       B   West    386     91   Mary
18 2023-01-19       C  North    761     47    Bob
19 2023-01-20       D  South    897     87  Alice

In [15]:
#creating seprate columns and rows

In [19]:
pd.pivot_table(df,values = 'Sales', index = 'Region', columns = 'Product', aggfunc = 'median')

Product      A      B      C      D
Region
East     730.0    NaN    NaN    NaN
North      NaN    NaN  761.0    NaN
South      NaN    NaN    NaN  584.0
West       NaN  581.0    NaN    NaN

In [21]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')

pivot2

##only numeric values can be used in values

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     596.8    NaN    NaN    NaN  40.4   NaN   NaN   NaN
North      NaN    NaN  654.0    NaN   NaN   NaN  46.6   NaN
South      NaN    NaN    NaN  489.8   NaN   NaN   NaN  61.0
West       NaN  515.2    NaN    NaN   NaN  45.0   NaN   NaN

Cross Tab (counting functions will be used )

In [24]:
pd.crosstab(df['Product'], df['Region'])

Region   East  North  South  West
Product
A           5      0      0     0
B           0      0      0     5
C           0      5      0     0
D           0      0      5     0

DataFrames Basic Operations

In [25]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [26]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [27]:
df1.shape

(5, 3)

In [29]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [30]:
df1.info

<bound method DataFrame.info of    A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500>

In [31]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [32]:
df1['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

Dataframe applying function

In [33]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [36]:
def square(x):
    return x**2

In [38]:
df1["B"].apply(square)

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64

In [39]:
df1['B'] = df1['B'].apply(square)

In [40]:
df1

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500

In [41]:
df1['B'] = df1['B'].apply(lambda x : x**2)

In [42]:
df1

   A        B    C
0  1    10000  100
1  2   160000  200
2  3   810000  300
3  4  2560000  400
4  5  6250000  500